CSI API ETABS v1

# cSapModelEditGeneral Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cEditGeneral EditGeneral { get; }

    ReadOnly Property EditGeneral As cEditGeneral
    	Get

    Dim instance As cSapModel
    Dim value As cEditGeneral

    value = instance.EditGeneral

    property cEditGeneral^ EditGeneral {
    	cEditGeneral^ get ();
    }

    abstract EditGeneral : cEditGeneral with get

#### Property Value

Type: cEditGeneral

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com